app/views/genres/_form.html.erb

SELECT "movies".* FROM "movies" ORDER BY "movies"."title" ASC
---
    <div class="checkboxes">
        <%= f.collection_check_boxes(:movie_ids, Movie.order(:title), :id, :title) %>