app/views/genres/index.html.erb

<h1><%= pluralize(@genres.size, "Genre") %></h1>
---
SELECT "genres".* FROM "genres"
SELECT COUNT(*) FROM "genres"