app/views/movies/_form.html.erb

SELECT "genres".* FROM "genres" ORDER BY "genres"."name" ASC
---
    <div class="checkboxes">
        <%= f.collection_check_boxes(:genre_ids, Genre.order(:name), :id, :name) %>