app/helpers/genres_helper.rb

    def total_movies_for_genre(genre)
        genre.movies.size
---
SELECT COUNT(*) FROM "movies" INNER JOIN "characterizations" ON "movies"."id" = "characterizations"."movie_id" WHERE "characterizations"."genre_id" = ?  [["genre_id", 1]]