app/controllers/genres_controller.rb

    def destroy
        @genre.destroy
---
DELETE FROM "genres" WHERE "genres"."id" = ?  [["id", 1]]

    def set_genre
        @genre = Genre.find(params[:id])
---
SELECT "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]