app/controllers/movies_controller.rb

    def show
        @fans = @movie.fans
        @genres = @movie.genres.order(:name)

        if current_user
            @favorite = current_user.favorites.find_by(movie_id: @movie.id)
---
SELECT "genres".* FROM "genres" INNER JOIN "characterizations" ON "genres"."id" = "characterizations"."genre_id" WHERE "characterizations"."movie_id" = ? ORDER BY "genres"."name" ASC  [["movie_id", 16]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."movie_id" = ? LIMIT ?  [["user_id", 7], ["movie_id", 16], ["LIMIT", 1]]
SELECT "genres".* FROM "genres" INNER JOIN "characterizations" ON "genres"."id" = "characterizations"."genre_id" WHERE "characterizations"."movie_id" = ?  [["movie_id", 16]]

    def update
        if @movie.update(movie_params)
---
UPDATE "movies" SET "total_gross" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["total_gross", 1110662843.0], ["updated_at", "2023-02-14 04:13:00.007533"], ["id", 2]]

    def create
        @movie = Movie.new(movie_params)

        if @movie.save
---
INSERT INTO "movies" ("title", "rating", "total_gross", "created_at", "updated_at", "description", "released_on", "director", "duration", "image_file_name") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)