app/controllers/reviews_controller.rb

    def create
        @review = @movie.reviews.new(review_params)
        @review.user = current_user

        if @review.save
---
INSERT INTO "reviews" ("stars", "comment", "movie_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["stars", 5], ["comment", "Mindblowing Movie!"], ["movie_id", 14], ["created_at", "2023-02-23 23:25:24.253823"], ["updated_at", "2023-02-23 23:25:24.253823"], ["user_id", 5]]