app/controllers/sessions_controller.rb

    def create
        user = User.find_by(email: params[:email_or_username]) ||
                User.find_by(username: params[:email_or_username])
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "dom@example.com"], ["LIMIT", 1]]